// 位置分组
export const POSITION_GROUPS = {
  "全部": [],
  "前场": ["中锋", "左边锋", "右边锋", "影锋"],
  "中场": ["前腰", "左前卫", "右前卫", "中前卫", "后腰"],
  "后场": ["左后卫", "右后卫", "中后卫", "门将"],
};

// 联赛分组
export const LEAGUE_GROUPS = {
  "全部": new Set(),
  "英超": new Set([
    "阿森纳", "阿斯顿维拉", "伯恩茅斯", "布莱顿", "布伦特福德",
    "切尔西", "曼联", "曼城", "利物浦", "纽卡斯尔", "热刺",
    "诺丁汉", "西汉姆", "富勒姆", "水晶宫", "埃弗顿", "伯恩利",
    "利兹联", "桑德兰", "沃尔弗汉普顿", "狼队", "阿斯顿"
  ]),
  "西甲": new Set([
    "巴萨", "皇马", "马竞", "毕尔巴鄂", "比利亚雷亚尔", "瓦伦西亚",
    "巴斯科希普斯夸", "塞维利亚特利亚纳", "塞维利亚内维翁", "希罗纳",
    "维戈", "塞维利亚", "塞维利亚特里亚纳"
  ]),
  "意甲": new Set([
    "AC米兰", "国米", "尤文图斯", "那不勒斯", "亚特兰大",
    "罗马", "拉齐奥", "博洛尼亚", "佛罗伦萨", "都灵", "热那亚", "科莫"
  ]),
  "德甲": new Set(["多特蒙德", "勒沃库森"]),
  "法甲": new Set(["巴黎", "摩纳哥", "哥特拉斯堡", "马赛", "里昂", "洛里昂"]),
  "葡超": new Set(["本菲卡", "波尔图", "葡萄牙体育"]),
  "土超": new Set(["费内巴切", "贝西克塔斯", "加拉塔萨雷", "特拉布宗体育"]),
  "美职联": new Set(["迈阿密", "洛杉矶"]),
  "亚足联": new Set(["利雅得希拉尔", "利雅得胜利", "吉达阿赫利", "伊蒂哈德", "胜利"]),
  "巴甲": new Set(["桑托斯"]),
  "其他联赛": new Set([
    "拜仁", "伊亚鲁", "利亚德希拉尔", "圣保罗", "埃尔比", "尼斯",
    "山东泰山", "希罗娜", "希罗那", "弗拉门戈", "拉科鲁尼亚",
    "斯科希普斯夸", "曼彻斯特", "比萨", "沃尔汉普顿", "温哥华",
    "罗萨里奥", "萨索洛", "费耶诺德", "里尔", "雷恩", "马略卡"
  ]),
};

// 国籍-大洲映射
export const COUNTRY_CONTINENT = {
  "丹麦": "欧洲", "乌克兰": "欧洲", "乌兹别克斯坦": "亚洲", "乌拉圭": "南美洲",
  "亚美尼亚": "欧洲", "俄罗斯": "欧洲", "保加利亚": "欧洲", "克罗地亚": "欧洲",
  "冈比亚": "非洲", "几内亚": "非洲", "几内亚比绍": "非洲", "刚国金": "非洲",
  "加拿大": "北美洲", "加纳": "非洲", "加蓬": "非洲", "匈牙利": "欧洲",
  "北爱尔兰": "欧洲", "厄瓜多尔": "南美洲", "哥伦比亚": "南美洲", "喀麦隆": "非洲",
  "土耳其": "欧洲", "埃及": "非洲", "塞内加尔": "非洲", "塞尔维亚": "欧洲",
  "墨西哥": "北美洲", "奥地利": "欧洲", "威尔士": "欧洲", "尼日利亚": "非洲",
  "巴拉圭": "南美洲", "巴西": "南美洲", "布基纳法索": "非洲", "希腊": "欧洲",
  "德国": "欧洲", "意大利": "欧洲", "挪威": "欧洲", "捷克": "欧洲",
  "摩洛哥": "非洲", "斯洛伐克": "欧洲", "斯洛文尼亚": "欧洲", "新西兰": "大洋洲",
  "日本": "亚洲", "智利": "南美洲", "格鲁吉亚": "欧洲", "比利时": "欧洲",
  "法国": "欧洲", "波兰": "欧洲", "波黑": "欧洲", "爱尔兰": "欧洲",
  "牙买加": "北美洲", "瑞典": "欧洲", "瑞士": "欧洲", "科特迪瓦": "非洲",
  "科索沃": "欧洲", "罗马尼亚": "欧洲", "美国": "北美洲", "芬兰": "欧洲",
  "苏格兰": "欧洲", "英格兰": "欧洲", "荷兰": "欧洲", "葡萄牙": "欧洲",
  "西班牙": "欧洲", "赤道几内亚": "非洲", "阿尔及利亚": "非洲", "阿根廷": "南美洲",
  "韩国": "亚洲", "马里": "非洲", "黑山": "欧洲"
};

export const CONTINENTS = ["全部", "欧洲", "南美洲", "北美洲", "非洲", "亚洲", "大洋洲", "其他"];
export const PLAYER_TYPES = ["全部", "现役", "历史"];
